[
  {
    "id": 1,
    "page_link": "https://docs.mindsdb.com/what-is-mindsdb",
    "title": "What is MindsDB? - MindsDB",
    "text": "Quickstart Quickstart Quickstart What is MindsDB? What is MindsDB? What is MindsDB? Data that lives in your database is a valuable asset. MindsDB enables you to use\nyour data and make forecasts. It speeds up the ML development process by\nbringing machine learning into the database. Data that lives in your database is a valuable asset. MindsDB enables you to use\nyour data and make forecasts. It speeds up the ML development process by\nbringing machine learning into the database. With MindsDB, you can build, train, optimize, and deploy your ML models without\nthe need for other platforms. And to get the forecasts, simply query your data\nand ML models. Read along to see some examples. With MindsDB, you can build, train, optimize, and deploy your ML models without\nthe need for other platforms. And to get the forecasts, simply query your data\nand ML models. Read along to see some examples. ​ (Reference url: https://docs.mindsdb.com/what-is-mindsdb#what-are-ai-tables) ​ What are AI Tables? What are AI Tables? MindsDB brings machine learning into databases by employing the concept of AI\nTables. MindsDB brings machine learning into databases by employing the concept of AI\nTables. AI Tables are machine learning models stored as virtual tables inside a\ndatabase. They facilitate making predictions based on your data. You can perform\nthe time series, regression, and classification predictions within your database\nand get the output almost instantly by querying an AI Table with simple SQL\nstatements. AI Tables are machine learning models stored as virtual tables inside a\ndatabase. They facilitate making predictions based on your data. You can perform\nthe time series, regression, and classification predictions within your database\nand get the output almost instantly by querying an AI Table with simple SQL\nstatements. ​ (Reference url: https://docs.mindsdb.com/what-is-mindsdb#deep-dive-into-the-ai-tables) ​ Deep Dive into the AI Tables Deep Dive into the AI Tables ​ (Reference url: https://docs.mindsdb.com/what-is-mindsdb#current-challenges) ​ Current Challenges Current Challenges Let’s consider the following income_table income_table table that stores the income income and debt debt values. ```\nSELECT income, debt\nFROM income_table;\n\n```SELECT SELECT income , , debt FROM FROM income_table ; ; On execution, we get: On execution, we get: ```\n+------+-----+\n|income|debt |\n+------+-----+\n|60000 |20000|\n|80000 |25100|\n|100000|30040|\n|120000|36010|\n+------+-----+\n\n```+ + ------+-----+ ------+-----+ | | income | | debt | | + + ------+-----+ ------+-----+ | | 60000 60000 | | 20000 20000 | | | | 80000 80000 | | 25100 25100 | | | | 100000 100000 | | 30040 30040 | | | | 120000 120000 | | 36010 36010 | | + + ------+-----+ ------+-----+ A simple visualization of the data present in the income_table income_table table is as\nfollows: Querying the income table to get the debt debt value for a particular income income value results in the following: ```\nSELECT income, debt\nFROM income_table\nWHERE income = 80000;\n\n```SELECT SELECT income , , debt FROM FROM income_table WHERE WHERE income = = 80000 80000 ; ; On execution, we get: On execution, we get: ```\n+------+-----+\n|income|debt |\n+------+-----+\n|80000 |25100|\n+------+-----+\n\n```+ + ------+-----+ ------+-----+ | | income | | debt | | + + ------+-----+ ------+-----+ | | 80000 80000 | | 25100 25100 | | + + ------+-----+ ------+-----+ And here is what we get: And here is what we get: But what happens when querying the table for an income income value that is not\npresent there? ```\nSELECT income, debt\nFROM income_table\nWHERE income = 90000;\n\n```SELECT SELECT income , , debt FROM FROM income_table WHERE WHERE income = = 90000 90000 ; ; On execution, we get: On execution, we get: ```\nEmpty set (0.00 sec)\n\n```Empty set set ( ( 0.00 0.00 sec ) ) When the WHERE WHERE clause condition is not fulfilled for any of the rows, no\nvalue is returned. When a table doesn’t have an exact match, the query returns an empty set or null\nvalue. This is where the AI Tables come into play! When a table doesn’t have an exact match, the query returns an empty set or null\nvalue. This is where the AI Tables come into play! ​ (Reference url: https://docs.mindsdb.com/what-is-mindsdb#solution-offered-by-mindsdb) ​ Solution Offered by MindsDB Solution Offered by MindsDB Let’s create a debt_model debt_model model that allows us to approximate the debt debt value\nfor any income income value. We train the debt_model debt_model model using the data from the income_table income_table table. ```\nCREATE MODEL mindsdb.debt_model\nFROM income_table\nPREDICT debt;\n\n```CREATE CREATE MODEL mindsdb . . debt_model FROM FROM income_table\nPREDICT debt ; ; On execution, we get: On execution, we get: ```\nQuery OK, 0 rows affected (x.xxx sec)\n\n```Query OK , , 0 0 rows rows affected ( ( x . . xxx sec ) ) MindsDB provides the CREATE MODEL (Reference url: https://docs.mindsdb.com/what-is-mindsdb/sql/create/predictor) CREATE MODEL CREATE MODEL statement. On execution of this statement, the predictive model works in the\nbackground, automatically creating a vector representation of the data that can\nbe visualized as follows: Let’s now look for the debt debt value of some random income income value. To get the\napproximated debt debt value, we query the mindsdb.debt_model mindsdb.debt_model model instead\nof the income_table income_table table. ```\nSELECT income, debt\nFROM mindsdb.debt_model\nWHERE income = 90000;\n\n```SELECT SELECT income , , debt FROM FROM mindsdb . . debt_model WHERE WHERE income = = 90000 90000 ; ; On execution, we get: On execution, we get: ```\n+------+-----+\n|income|debt |\n+------+-----+\n|90000 |27820|\n+------+-----+\n\n```+ + ------+-----+ ------+-----+ | | income | | debt | | + + ------+-----+ ------+-----+ | | 90000 90000 | | 27820 27820 | | + + ------+-----+ ------+-----+ And here is how it looks: And here is how it looks: ​ (Reference url: https://docs.mindsdb.com/what-is-mindsdb#why-choose-mindsdb) ​ Why Choose MindsDB? Why Choose MindsDB? ​ (Reference url: https://docs.mindsdb.com/what-is-mindsdb#shift-to-data-analysis-paradigm) ​ Shift to Data Analysis Paradigm Shift to Data Analysis Paradigm There is an ongoing transformational shift within the modern business world from\nthe “what happened and why” based on historical data analysis to the “what will\nhappen and how can we make it happen” based on machine learning predictive\nmodeling. There is an ongoing transformational shift within the modern business world from\nthe “what happened and why” based on historical data analysis to the “what will\nhappen and how can we make it happen” based on machine learning predictive\nmodeling. The success of your predictions depends both on the data you have available and\nthe models trained with the data. Data Scientists and Data Engineers require\nefficient and easy-to-use tools to prepare the data for feature engineering,\nthen training the models, and finally, deploying, monitoring, and managing these\nimplementations for optimal prediction confidence. The success of your predictions depends both on the data you have available and\nthe models trained with the data. Data Scientists and Data Engineers require\nefficient and easy-to-use tools to prepare the data for feature engineering,\nthen training the models, and finally, deploying, monitoring, and managing these\nimplementations for optimal prediction confidence. ​ (Reference url: https://docs.mindsdb.com/what-is-mindsdb#the-machine-learning-lifecycle) ​ The Machine Learning Lifecycle The Machine Learning Lifecycle The ML lifecycle is a process that consists of the data preparation phase,\nmodeling phase, and deployment phase. The diagram below presents all the steps\nincluded in each of the stages. The ML lifecycle is a process that consists of the data preparation phase,\nmodeling phase, and deployment phase. The diagram below presents all the steps\nincluded in each of the stages. Current solutions for implementing machine learning encounter various\nchallenges, such as time-consuming preparation, cleaning, and labeling of\nsubstantial amounts of data, and difficulties in finding qualified ML/AI data\nscientists. Current solutions for implementing machine learning encounter various\nchallenges, such as time-consuming preparation, cleaning, and labeling of\nsubstantial amounts of data, and difficulties in finding qualified ML/AI data\nscientists. The processes that must be followed by the ML/AI data scientists to implement\nmachine learning include the following: The processes that must be followed by the ML/AI data scientists to implement\nmachine learning include the following: feature engineering, feature engineering, building, training, and optimizing models, building, training, and optimizing models, assembling, verifying, and deploying models to production, assembling, verifying, and deploying models to production, continuously monitoring and improving the models, continuously monitoring and improving the models, continuously training the models, as they require multiple training iterations\nwith existing data, continuously training the models, as they require multiple training iterations\nwith existing data, extracting, transforming, and loading (ETL) data from one system to another,\nwhich is complicated and may lead to multiple copies of information. extracting, transforming, and loading (ETL) data from one system to another,\nwhich is complicated and may lead to multiple copies of information. A recent study has shown it takes 64% of companies a month up to over a year to\ndeploy a machine learning model into production. Leveraging existing databases\nand automating all the aforementioned processes is called AutoML. AutoML has\nbeen gaining traction within enterprises for enabling non-experts to use machine\nlearning models for practical applications. A recent study has shown it takes 64% of companies a month up to over a year to\ndeploy a machine learning model into production. Leveraging existing databases\nand automating all the aforementioned processes is called AutoML. AutoML has\nbeen gaining traction within enterprises for enabling non-experts to use machine\nlearning models for practical applications. ​ (Reference url: https://docs.mindsdb.com/what-is-mindsdb#why-mindsdb) ​ Why MindsDB? Why MindsDB? Well, as with most names, we needed one. We like science fiction and The Culture The Culture series,\nwhere the AI super-smart entities are called Minds Minds . So that’s for the first\npart of our name. As for the second part - the DB DB , it is quite self-explanatory. Although we\nwill support all kinds of data in the future, but currently, our objective is to\nadd intelligence to existing data stores and databases. Hence, the term DB DB comes along. So there we have it, MindsDB. So there we have it, MindsDB. And why the bear? We wanted to honor the open-source tradition of animals\nrelated to projects. We went for a bear because MindsDB was born at UC Berkeley,\nwhere the first codes were written. Then, we went a step further and decided for\na polar bear. And why the bear? We wanted to honor the open-source tradition of animals\nrelated to projects. We went for a bear because MindsDB was born at UC Berkeley,\nwhere the first codes were written. Then, we went a step further and decided for\na polar bear. ​ (Reference url: https://docs.mindsdb.com/what-is-mindsdb#how-to-help-democratize-machine-learning) ​ How to Help Democratize Machine Learning? How to Help Democratize Machine Learning? Here is what you can do: Here is what you can do: Go ahead and try out MindsDB by following our tutorials, and in case of\nproblems, you can always report an issue here report an issue here . Are you familiar with Python? You can then help us out in resolving open\nissues. At first, have a look at issues labeled with the good first issue tag issues labeled with the good first issue tag ,\nas these should be easy to start. You can also help us with documentation and tutorials. Here is how you can\ncontribute by writing documentation (Reference url: https://docs.mindsdb.com/what-is-mindsdb/contribute/docs) documentation and tutorials (Reference url: https://docs.mindsdb.com/what-is-mindsdb/contribute/tutorials) tutorials . Don’t\nforget to follow the style guide (Reference url: https://docs.mindsdb.com/what-is-mindsdb/docs-rules) style guide . Share with your friends and spread the word about MindsDB. Share with your friends and spread the word about MindsDB. Join our team! We are a fast-growing company, so we always have a few open positions a few open positions . From Our Community From Our Community From Our Community Check out the articles and video guides created by our community: Check out the articles and video guides created by our community: Article on What is MindsDB? What is MindsDB? by Gloria Okeke E.J Gloria Okeke E.J Article on What is MindsDB? How to get started with it  What is MindsDB? How to get started with it by Hritik Dangi Hritik Dangi Video guide on Video: What is MindsDB? Video: What is MindsDB? by Alissa Troiano Alissa Troiano Video guide on What is MindsDB | How to Get Started | A Cloud/AI Enabled Database What is MindsDB | How to Get Started | A Cloud/AI Enabled Database by Arman Chand Arman Chand Video guide on What is MindsDB and How to Get Started What is MindsDB and How to Get Started by Hritik Dangi Hritik Dangi Video guide on What is MindsDB? What is MindsDB? uploaded on ExploringTech ExploringTech by Rutam Prita Mishra Rutam Prita Mishra Video guide on What is MindsDB - AI Database Prediction What is MindsDB - AI Database Prediction by Bhavesh Mishra Bhavesh Mishra Video guide on What is MindsDB ? What is MindsDB ? by Syed Zubeen Syed Zubeen Try It Out! (Reference url: https://docs.mindsdb.com/what-is-mindsdb/quickstart) Try It Out! Powered by Mintlify Powered by Mintlify Powered by Mintlify github github github facebook facebook facebook twitter twitter twitter slack slack slack linkedin linkedin linkedin youtube youtube youtube medium medium medium What are AI Tables? What are AI Tables? (Reference url: https://docs.mindsdb.com/what-is-mindsdb#what-are-ai-tables) What are AI Tables? Deep Dive into the AI Tables Deep Dive into the AI Tables (Reference url: https://docs.mindsdb.com/what-is-mindsdb#deep-dive-into-the-ai-tables) Deep Dive into the AI Tables Current Challenges Current Challenges (Reference url: https://docs.mindsdb.com/what-is-mindsdb#current-challenges) Current Challenges Solution Offered by MindsDB Solution Offered by MindsDB (Reference url: https://docs.mindsdb.com/what-is-mindsdb#solution-offered-by-mindsdb) Solution Offered by MindsDB Why Choose MindsDB? Why Choose MindsDB? (Reference url: https://docs.mindsdb.com/what-is-mindsdb#why-choose-mindsdb) Why Choose MindsDB? Shift to Data Analysis Paradigm Shift to Data Analysis Paradigm (Reference url: https://docs.mindsdb.com/what-is-mindsdb#shift-to-data-analysis-paradigm) Shift to Data Analysis Paradigm The Machine Learning Lifecycle The Machine Learning Lifecycle (Reference url: https://docs.mindsdb.com/what-is-mindsdb#the-machine-learning-lifecycle) The Machine Learning Lifecycle Why MindsDB? Why MindsDB? (Reference url: https://docs.mindsdb.com/what-is-mindsdb#why-mindsdb) Why MindsDB? How to Help Democratize Machine Learning? How to Help Democratize Machine Learning? (Reference url: https://docs.mindsdb.com/what-is-mindsdb#how-to-help-democratize-machine-learning) How to Help Democratize Machine Learning? ",
    "source_links": [
      "#what-are-ai-tables",
      "#deep-dive-into-the-ai-tables",
      "#current-challenges",
      "#solution-offered-by-mindsdb",
      "/sql/create/predictor",
      "#why-choose-mindsdb",
      "#shift-to-data-analysis-paradigm",
      "#the-machine-learning-lifecycle",
      "#why-mindsdb",
      "#how-to-help-democratize-machine-learning",
      "/contribute/docs",
      "/contribute/tutorials",
      "/docs-rules",
      "/quickstart",
      "#what-are-ai-tables",
      "#deep-dive-into-the-ai-tables",
      "#current-challenges",
      "#solution-offered-by-mindsdb",
      "#why-choose-mindsdb",
      "#shift-to-data-analysis-paradigm",
      "#the-machine-learning-lifecycle",
      "#why-mindsdb",
      "#how-to-help-democratize-machine-learning"
    ]
  },
  {
    "id": 2,
    "page_link": "https://docs.mindsdb.com/quickstart",
    "title": "Quickstart - MindsDB",
    "text": "Quickstart Quickstart Quickstart Quickstart Quickstart Quickstart Follow the steps below to start making data forecasts with MindsDB using standard SQL. Follow the steps below to start making data forecasts with MindsDB using standard SQL. Check out our Getting Started guide (Reference url: https://docs.mindsdb.com/quickstart/getting-started) Getting Started guide to set up and work with\nMindsDB using your own data and models. ​ (Reference url: https://docs.mindsdb.com/quickstart#1-create-a-mindsdb-cloud-account-or-install-mindsdb-locally) ​ 1. Create a MindsDB Cloud Account or Install MindsDB Locally 1. Create a MindsDB Cloud Account or Install MindsDB Locally Create your free MindsDB Cloud account free MindsDB Cloud account to\nstart practicing right away using the MindsDB Cloud Editor. If you prefer a local MindsDB installation, follow the Deployment Deployment guides of\nMindsDB documentation. You can install MindsDB using Docker Docker or follow the standard installation using pip pip . ​ (Reference url: https://docs.mindsdb.com/quickstart#2-connect-to-mindsdb-from-a-sql-client) ​ 2. Connect to MindsDB from a SQL Client 2. Connect to MindsDB from a SQL Client You can use the MindsDB Cloud Editor or open your preferred SQL client, such\nas DBeaver or MySQL CLI, and connect to MindsDB. You can use the MindsDB Cloud Editor or open your preferred SQL client, such\nas DBeaver or MySQL CLI, and connect to MindsDB. Using the MindsDB Cloud Editor Using the MindsDB Cloud Editor Using the MindsDB Cloud Editor Using a Third-Party SQL Client Using a Third-Party SQL Client Using a Third-Party SQL Client Log in to your MindsDB Cloud account. The EditorEditor is the first thing you’ll see! ​ (Reference url: https://docs.mindsdb.com/quickstart#3-connect-a-database-using-create-database) ​ 3. Connect a Database Using CREATE DATABASE (Reference url: https://docs.mindsdb.com/quickstart/sql/create/databases) CREATE DATABASE CREATE DATABASE We have a sample database that you can use right away. To connect a database to your MindsDB Cloud account, use the CREATE DATABASE (Reference url: https://docs.mindsdb.com/quickstart/sql/create/databases) CREATE DATABASE CREATE DATABASE statement, as below. ```\nCREATE DATABASE example_data\nWITH ENGINE = \"postgres\",\nPARAMETERS = {\n  \"user\": \"demo_user\",\n  \"password\": \"demo_password\",\n  \"host\": \"3.220.66.106\",\n  \"port\": \"5432\",\n  \"database\": \"demo\"\n};\n\n```CREATE CREATE DATABASE DATABASE example_data WITH WITH ENGINE ENGINE = = \"postgres\" \"postgres\" , , PARAMETERS = = { \"user\" \"user\" : \"demo_user\" \"demo_user\" , , \"password\" \"password\" : \"demo_password\" \"demo_password\" , , \"host\" \"host\" : \"3.220.66.106\" \"3.220.66.106\" , , \"port\" \"port\" : \"5432\" \"5432\" , , \"database\" \"database\" : \"demo\" \"demo\" } ; ; On execution, we get: On execution, we get: ```\nQuery OK, 0 rows affected (3.22 sec)\n\n```Query OK , , 0 0 rows rows affected ( ( 3.22 3.22 sec ) ) ​ (Reference url: https://docs.mindsdb.com/quickstart#4-preview-the-available-data-using-select) ​ 4. Preview the Available Data Using SELECT (Reference url: https://docs.mindsdb.com/quickstart/sql/api/select) SELECT SELECT You can now preview the available data with a standard SELECT SELECT statement. ```\nSELECT *\nFROM example_data.demo_data.home_rentals\nLIMIT 10;\n\n```SELECT SELECT * * FROM FROM example_data . . demo_data . . home_rentals LIMIT LIMIT 10 10 ; ; On execution, we get: On execution, we get: ```\n+-----------------+---------------------+------+----------+----------------+---------------+--------------+--------------+\n| number_of_rooms | number_of_bathrooms | sqft | location | days_on_market | initial_price | neighborhood | rental_price |\n+-----------------+---------------------+------+----------+----------------+---------------+--------------+--------------+\n| 0.0             | 1.0                 | 484  | great    | 10             | 2271          | south_side   | 2271         |\n| 1.0             | 1.0                 | 674  | good     | 1              | 2167          | downtown     | 2167         |\n| 1.0             | 1.0                 | 554  | poor     | 19             | 1883          | westbrae     | 1883         |\n| 0.0             | 1.0                 | 529  | great    | 3              | 2431          | south_side   | 2431         |\n| 3.0             | 2.0                 | 1219 | great    | 3              | 5510          | south_side   | 5510         |\n| 1.0             | 1.0                 | 398  | great    | 11             | 2272          | south_side   | 2272         |\n| 3.0             | 2.0                 | 1190 | poor     | 58             | 4463          | westbrae     | 4124         |\n| 1.0             | 1.0                 | 730  | good     | 0              | 2224          | downtown     | 2224         |\n| 0.0             | 1.0                 | 298  | great    | 9              | 2104          | south_side   | 2104         |\n| 2.0             | 1.0                 | 878  | great    | 8              | 3861          | south_side   | 3861         |\n+-----------------+---------------------+------+----------+----------------+---------------+--------------+--------------+\n\n```+ + -----------------+---------------------+------+----------+----------------+---------------+--------------+--------------+ -----------------+---------------------+------+----------+----------------+---------------+--------------+--------------+ | | number_of_rooms | | number_of_bathrooms | | sqft | | location | | days_on_market | | initial_price | | neighborhood | | rental_price | | + + -----------------+---------------------+------+----------+----------------+---------------+--------------+--------------+ -----------------+---------------------+------+----------+----------------+---------------+--------------+--------------+ | | 0.0 0.0 | | 1.0 1.0 | | 484 484 | | great | | 10 10 | | 2271 2271 | | south_side | | 2271 2271 | | | | 1.0 1.0 | | 1.0 1.0 | | 674 674 | | good | | 1 1 | | 2167 2167 | | downtown | | 2167 2167 | | | | 1.0 1.0 | | 1.0 1.0 | | 554 554 | | poor | | 19 19 | | 1883 1883 | | westbrae | | 1883 1883 | | | | 0.0 0.0 | | 1.0 1.0 | | 529 529 | | great | | 3 3 | | 2431 2431 | | south_side | | 2431 2431 | | | | 3.0 3.0 | | 2.0 2.0 | | 1219 1219 | | great | | 3 3 | | 5510 5510 | | south_side | | 5510 5510 | | | | 1.0 1.0 | | 1.0 1.0 | | 398 398 | | great | | 11 11 | | 2272 2272 | | south_side | | 2272 2272 | | | | 3.0 3.0 | | 2.0 2.0 | | 1190 1190 | | poor | | 58 58 | | 4463 4463 | | westbrae | | 4124 4124 | | | | 1.0 1.0 | | 1.0 1.0 | | 730 730 | | good | | 0 0 | | 2224 2224 | | downtown | | 2224 2224 | | | | 0.0 0.0 | | 1.0 1.0 | | 298 298 | | great | | 9 9 | | 2104 2104 | | south_side | | 2104 2104 | | | | 2.0 2.0 | | 1.0 1.0 | | 878 878 | | great | | 8 8 | | 3861 3861 | | south_side | | 3861 3861 | | + + -----------------+---------------------+------+----------+----------------+---------------+--------------+--------------+ -----------------+---------------------+------+----------+----------------+---------------+--------------+--------------+ You could also browse the databases of MindsDB using the command below. You could also browse the databases of MindsDB using the command below. ```\nSHOW databases;\n\n```SHOW SHOW databases databases ; ; On execution, we get: On execution, we get: ```\n+---------------------+\n| Database            |\n+---------------------+\n| information_schema  |\n| mindsdb             |\n| files               |\n| example_data        |\n+---------------------+\n\n```+ + ---------------------+ ---------------------+ | | Database Database | | + + ---------------------+ ---------------------+ | | information_schema | | | | mindsdb | | | | files | | | | example_data | | + + ---------------------+ ---------------------+ To learn more about MindsDB tables structure, check out this guide (Reference url: https://docs.mindsdb.com/quickstart/sql/table-structure) this guide . ​ (Reference url: https://docs.mindsdb.com/quickstart#5-create-a-model-using-create-model) ​ 5. Create a Model Using CREATE MODEL (Reference url: https://docs.mindsdb.com/quickstart/sql/create/predictor) CREATE MODEL CREATE MODEL Now you are ready to create your first model. Use the CREATE MODEL (Reference url: https://docs.mindsdb.com/quickstart/sql/create/predictor) CREATE MODEL CREATE MODEL statement, as below. ```\nCREATE MODEL mindsdb.home_rentals_model\nFROM example_data\n  (SELECT * FROM demo_data.home_rentals)\nPREDICT rental_price;\n\n```CREATE CREATE MODEL mindsdb . . home_rentals_model FROM FROM example_data ( ( SELECT SELECT * * FROM FROM demo_data . . home_rentals ) ) PREDICT rental_price ; ; On execution, we get: On execution, we get: ```\nQuery OK, 0 rows affected (9.79 sec)\n\n```Query OK , , 0 0 rows rows affected ( ( 9.79 9.79 sec ) ) ​ (Reference url: https://docs.mindsdb.com/quickstart#6-check-the-status-of-a-model) ​ 6. Check the Status of a Model 6. Check the Status of a Model It may take a couple of minutes until the model is trained. You can monitor\nthe status of your model by executing the following command: It may take a couple of minutes until the model is trained. You can monitor\nthe status of your model by executing the following command: ```\nSELECT status\nFROM mindsdb.models\nWHERE name = 'home_rentals_model';\n\n```SELECT SELECT status status FROM FROM mindsdb . . models WHERE WHERE name = = 'home_rentals_model' 'home_rentals_model' ; ; On execution, we get: On execution, we get: ```\n+------------+\n| status     |\n+------------+\n| generating |\n+------------+\n\n```+ + ------------+ ------------+ | | status status | | + + ------------+ ------------+ | | generating | | + + ------------+ ------------+ After a short time, we get: After a short time, we get: ```\n+----------+\n| status   |\n+----------+\n| training |\n+----------+\n\n```+ + ----------+ ----------+ | | status status | | + + ----------+ ----------+ | | training | | + + ----------+ ----------+ And finally, we get: And finally, we get: ```\n+----------+\n| status   |\n+----------+\n| complete |\n+----------+\n\n```+ + ----------+ ----------+ | | status status | | + + ----------+ ----------+ | | complete | | + + ----------+ ----------+ Alternatively, you can use the SHOW MODELS SHOW MODELS command as below. ```\nSHOW MODELS\n[FROM project_name]\n[LIKE 'model_name']\n[WHERE column_name = value];\n\n```SHOW SHOW MODELS [ [ FROM FROM project_name ] ] [ [ LIKE LIKE 'model_name' 'model_name' ] ] [ [ WHERE WHERE column_name = = value value ] ] ; ; Here is an example: Here is an example: ```\nSHOW MODELS\nFROM mindsdb\nLIKE 'home_rentals_model'\nWHERE status = 'complete';\n\n```SHOW SHOW MODELS FROM FROM mindsdb LIKE LIKE 'home_rentals_model' 'home_rentals_model' WHERE WHERE status status = = 'complete' 'complete' ; ; The status of the model must be complete complete before you can start making predictions. ​ (Reference url: https://docs.mindsdb.com/quickstart#7-make-predictions-using-select) ​ 7. Make Predictions Using SELECT (Reference url: https://docs.mindsdb.com/quickstart/sql/api/select) SELECT SELECT The SELECT (Reference url: https://docs.mindsdb.com/quickstart/sql/api/select) SELECT SELECT statement allows you to make predictions based\non features, where features are the input variables, or input columns, that are\nused to make forecasts. Let’s predict what would be the rental price of a 1000 square feet house with\ntwo bathrooms. Let’s predict what would be the rental price of a 1000 square feet house with\ntwo bathrooms. ```\nSELECT rental_price\nFROM mindsdb.home_rentals_model\nWHERE number_of_bathrooms = 2\nAND sqft = 1000;\n\n```SELECT SELECT rental_price FROM FROM mindsdb . . home_rentals_model WHERE WHERE number_of_bathrooms = = 2 2 AND AND sqft = = 1000 1000 ; ; On execution, we get: On execution, we get: ```\n+--------------+\n| rental_price |\n+--------------+\n| 1130         |\n+--------------+\n\n```+ + --------------+ --------------+ | | rental_price | | + + --------------+ --------------+ | | 1130 1130 | | + + --------------+ --------------+ Here is how to make batch predictions: Here is how to make batch predictions: ```\nSELECT m.rental_price, m.rental_price_explain\nFROM mindsdb.home_rentals_model AS m\nJOIN example_data.demo_data.home_rentals AS d;\n\n```SELECT SELECT m . . rental_price , , m . . rental_price_explain FROM FROM mindsdb . . home_rentals_model AS AS m JOIN JOIN example_data . . demo_data . . home_rentals AS AS d ; ; Congratulations! Congratulations! If you got this far, you have successfully trained a predictive model using SQL\nand got the future data! From Our Community From Our Community From Our Community Check out the articles and video guides created by our community: Check out the articles and video guides created by our community: Article on Self-Service Machine Learning with Intelligent Databases Self-Service Machine Learning with Intelligent Databases by MindsDB Team MindsDB Team Article on MindsDB: Your Introduction to Creating Machine Learning Predictive Models MindsDB: Your Introduction to Creating Machine Learning Predictive Models by Chandre Van Der Westhuizen Chandre Van Der Westhuizen Article on Introduction to AI Tables Introduction to AI Tables by Javi Sánchez Javi Sánchez Article on Why Your Database Needs a Machine Learning Brain Why Your Database Needs a Machine Learning Brain by James Wilson James Wilson Video guide on How Mindsdb is impacting the world of Machine Learning How Mindsdb is impacting the world of Machine Learning by Prathik Shetty Prathik Shetty Video guide on Simple starting guide video tutorial for MindsDB Simple starting guide video tutorial for MindsDB by Posterizedsoul Posterizedsoul Video guide on What are AI Tables and How to use MindsDB ? What are AI Tables and How to use MindsDB ? by @akhilcoder @akhilcoder Video guide on MindsDB - Predict data with machine learning MindsDB - Predict data with machine learning by HellFire HellFire What is MindsDB? (Reference url: https://docs.mindsdb.com/quickstart/what-is-mindsdb) What is MindsDB? MindsDB Cloud (Reference url: https://docs.mindsdb.com/quickstart/setup/cloud) MindsDB Cloud Powered by Mintlify Powered by Mintlify Powered by Mintlify github github github facebook facebook facebook twitter twitter twitter slack slack slack linkedin linkedin linkedin youtube youtube youtube medium medium medium 1. Create a MindsDB Cloud Account or Install MindsDB Locally 1. Create a MindsDB Cloud Account or Install MindsDB Locally (Reference url: https://docs.mindsdb.com/quickstart#1-create-a-mindsdb-cloud-account-or-install-mindsdb-locally) 1. Create a MindsDB Cloud Account or Install MindsDB Locally 2. Connect to MindsDB from a SQL Client 2. Connect to MindsDB from a SQL Client (Reference url: https://docs.mindsdb.com/quickstart#2-connect-to-mindsdb-from-a-sql-client) 2. Connect to MindsDB from a SQL Client 3. Connect a Database Using CREATE DATABASE 3. Connect a Database Using CREATE DATABASE (Reference url: https://docs.mindsdb.com/quickstart#3-connect-a-database-using-create-database) 3. Connect a Database Using CREATE DATABASE 4. Preview the Available Data Using SELECT 4. Preview the Available Data Using SELECT (Reference url: https://docs.mindsdb.com/quickstart#4-preview-the-available-data-using-select) 4. Preview the Available Data Using SELECT 5. Create a Model Using CREATE MODEL 5. Create a Model Using CREATE MODEL (Reference url: https://docs.mindsdb.com/quickstart#5-create-a-model-using-create-model) 5. Create a Model Using CREATE MODEL 6. Check the Status of a Model 6. Check the Status of a Model (Reference url: https://docs.mindsdb.com/quickstart#6-check-the-status-of-a-model) 6. Check the Status of a Model 7. Make Predictions Using SELECT 7. Make Predictions Using SELECT (Reference url: https://docs.mindsdb.com/quickstart#7-make-predictions-using-select) 7. Make Predictions Using SELECT ",
    "source_links": [
      "/getting-started",
      "#1-create-a-mindsdb-cloud-account-or-install-mindsdb-locally",
      "#2-connect-to-mindsdb-from-a-sql-client",
      "#3-connect-a-database-using-create-database",
      "/sql/create/databases",
      "/sql/create/databases",
      "#4-preview-the-available-data-using-select",
      "/sql/api/select",
      "/sql/table-structure",
      "#5-create-a-model-using-create-model",
      "/sql/create/predictor",
      "/sql/create/predictor",
      "#6-check-the-status-of-a-model",
      "#7-make-predictions-using-select",
      "/sql/api/select",
      "/sql/api/select",
      "/what-is-mindsdb",
      "/setup/cloud",
      "#1-create-a-mindsdb-cloud-account-or-install-mindsdb-locally",
      "#2-connect-to-mindsdb-from-a-sql-client",
      "#3-connect-a-database-using-create-database",
      "#4-preview-the-available-data-using-select",
      "#5-create-a-model-using-create-model",
      "#6-check-the-status-of-a-model",
      "#7-make-predictions-using-select"
    ]
  }
]
